In [19]:
# 각 컬럼별로 unique()해서 고윳값을 뽑아내서 결측치를 제거해야 한다
# 그냥 평균값을 넣으면 곤란하다
# Series에 Object데이터 타입이 있어야 str속성을 사용할 수 있다

두 개의 DataFrame을 행(row) 방향 데이터 연결

In [20]:
import pandas as pd

In [21]:
datas={'name':["홍 길동","이 나영","마 징가","배 토벤"],
        'age':[10,21,73,89],
        'reg_date':["2010/01/23","2020/11/8","1995/5/4","1987/12/24"]}
datas2=[['name',"홍 길동","이 나영","마 징가","배 토벤"],
        ['age',10,21,73,89],
        ['reg_date',"2010/01/23","2020/11/8","1995/5/4","1987/12/24"]]
# 리스트와 튜플을 가지고 DF를 만들때와
# 딕셔너리를 가지고 DF를 만들때의 차이점
# -> 딕셔너리는 키값이 열로 들어가서 세로로 만들어지고, 리스트는 한 줄이 한 행이 되어버린다
# -> 즉 딕셔너리는 세로로 들어감, 리스트는 가로로 들어감

In [22]:
# Dict => DataFrame
df1=pd.DataFrame(datas)
df1

   name  age    reg_date
0  홍 길동   10  2010/01/23
1  이 나영   21   2020/11/8
2  마 징가   73    1995/5/4
3  배 토벤   89  1987/12/24

In [23]:
# List => DataFrame
df2=pd.DataFrame(datas2)
df2

          0           1          2         3           4
0      name        홍 길동       이 나영      마 징가        배 토벤
1       age          10         21        73          89
2  reg_date  2010/01/23  2020/11/8  1995/5/4  1987/12/24

In [24]:
namesDF=df1["name"].str.split(" ", expand=True)
namesDF

   0   1
0  홍  길동
1  이  나영
2  마  징가
3  배  토벤

In [25]:
df1.columns=[0,1,2]
df1

      0   1           2
0  홍 길동  10  2010/01/23
1  이 나영  21   2020/11/8
2  마 징가  73    1995/5/4
3  배 토벤  89  1987/12/24

In [28]:
pd.concat([df1,namesDF], join="inner") # 동일 컬럼명/행 인덱스만 연결 시켜주는 방식 => inner방식(열이름 교집합)

      0   1
0  홍 길동  10
1  이 나영  21
2  마 징가  73
3  배 토벤  89
0     홍  길동
1     이  나영
2     마  징가
3     배  토벤

In [29]:
pd.concat([df1,namesDF], join="outer") # 모든 컬럼명/행 인덱스만 연결 시켜주는 방식 => outer방식(기본값)(열이름 합집합)

      0   1           2
0  홍 길동  10  2010/01/23
1  이 나영  21   2020/11/8
2  마 징가  73    1995/5/4
3  배 토벤  89  1987/12/24
0     홍  길동         NaN
1     이  나영         NaN
2     마  징가         NaN
3     배  토벤         NaN

In [30]:
#df1.append(namesDF) # append는 제거됨

AttributeError: 'DataFrame' object has no attribute 'append'

In [31]:
# merge는 concat과 다르게 기준 열을 잡아야한다 -> merge, concat -> 열 인덱스 기준 결합
# join -> 행 인덱스 기준 결합

### [병합 - merge]
- 두 개의 DF에서 특정 컬럼을 기준으로 데이터를 합치는 것
- 두 DF에 합치는 기준이 되는 컬럼을 지정 필요
- 지정된 컬럼명이 없으면 동일한 컬럼명을 기준으로 합쳐짐

In [ ]:
f1="../DATA/stock price.xlsx"
f2="../DATA/stock valuation.xlsx"
df1=pd.read_excel(f1)
df2=pd.read_excel(f2)
# 두 개의 DF에서 동일 컬럼명을 찾아서 두 DF에 존재하는 컬럼명의 행 데이터만 합치기
pd.merge(df1,df2) # 따로 지정해주지 않으면 알아서 찾아준다
# 두 컬럼명을 찾아서 모두 합치기
pd.merge(df1,df2, how="outer")

In [ ]:
#왼쪽 컬럼명을 찾아서 왼쪽 DF데이터를 찾아줌
pd.merge(df1,df2, how="left")

In [ ]:
#왼쪽 컬럼명을 찾아서 왼쪽 DF데이터를 찾아줌
pd.merge(df1,df2, how="cross")